# WEEK11 Car Listings Data Analysis: Cleaning, Exploration, and Visualization <hr style="border:2.5px solid #FFC0CB"></hr>

Name:**Wendy Sai D. Infante** <br>
Course:**CPE2A**

In [234]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

 Load dataset

In [235]:
df = pd.read_csv(r"C:\Users\ASUS\Documents\CAR_DETAILS.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4340 entries, 0 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4340 non-null   object
 1   year           4340 non-null   int64
 2   selling_price  4340 non-null   int64
 3   km_driven      4340 non-null   int64
 4   fuel           3906 non-null   object
 5   seller_type    3906 non-null   object
 6   transmission   3906 non-null   object
 7   owner          3906 non-null   object
dtypes: int64(3), object(5)
memory usage: 271.4+ KB

Display initial data overview

In [236]:
print(df.isnull().sum())

name               0
year               0
selling_price      0
km_driven          0
fuel             434
seller_type      434
transmission     434
owner            434
dtype: int64

In [237]:
num_cols = df.select_dtypes(include=[np.number]).columns  # Select only numeric columns
df[num_cols] = df[num_cols].fillna(df[num_cols].mean())

In [238]:
cat_cols = df.select_dtypes(include=[object]).columns
df[cat_cols] = df[cat_cols].fillna(df[cat_cols].mode().iloc[0])

In [239]:
print("\nDuplicates before removal:", df.duplicated().sum())
df = df.drop_duplicates()
print("Duplicates after removal:", df.duplicated().sum())

Duplicates before removal: 642
Duplicates after removal: 0

In [240]:
print(df.isnull().sum())

name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

In [241]:
df['year'] = df['year'].astype(int)

In [242]:
df.describe()

              year  selling_price      km_driven
count  3698.000000   3.698000e+03    3698.000000
mean   2012.967280   4.784706e+05   68661.271769
std       4.252035   5.234857e+05   47239.887860
min    1992.000000   2.000000e+04       1.000000
25%    2010.000000   2.000000e+05   35002.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [243]:
df.to_csv("C:/Users/ASUS/Documents/CAR_DETAILS_CLEANED.csv", index=False)

In [244]:

print("\nData Cleaning Completed. Cleaned file saved.")

Data Cleaning Completed. Cleaned file saved.

## Data Visualization of Cleaned DataSet

In [247]:
df = pd.read_csv(r"..\raw\cleaned_car_details.csv",
                 delimiter=",")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2412 entries, 0 to 2411
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           2412 non-null   object
 1   year           2412 non-null   int64
 2   selling_price  2412 non-null   int64
 3   km_driven      2412 non-null   int64
 4   fuel           2412 non-null   object
 5   seller_type    2412 non-null   object
 6   transmission   2412 non-null   object
 7   owner          2412 non-null   object
dtypes: int64(3), object(5)
memory usage: 150.9+ KB

In [252]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
1,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
2,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
3,Tata Indigo Grand Petrol,2014,240000,60000,Petrol,Individual,Manual,Second Owner
4,Maruti Celerio Green VXI,2017,365000,78000,CNG,Individual,Manual,First Owner